[TOC]



# 查看交换机MAC地址表

基于目标Mac地址转发，能够学习Mac地址，端口独享带宽，没有冲突，但是遇到广播（mac地址全F），会将数据帧转发到所有的Mac地址

Cisco Packet Tracer： 模拟交换机的软件

```shell
Switch#show mac-address-table
```

![1566388783358](E:\git-workspace\note\images\computeNetwork\1566388783358.png?raw=true)


# 交换机的端口安全

## 控制交换机上绑定的数量

```shell
config t
interface fastEthernet 0/4
switchport mode access
switchport port-security
switchport port-security violation shutdown
switchport port-security maximum 2

#重启
#shut down
#no shut down 
```



## 绑定Mac地址

```shell
#针对1-24口进行配置
interface range fastEthernet 0/1 - 24
switchport mode access
switchport port-security sticky

#再次查看Mac地址表，可以看到type变成了static
Switch#show mac-address-table
```

![1566390522631](E:\git-workspace\note\images\computeNetwork\1566390522631.png?raw=true)

当我们修改一个计算机的Mac地址的时候，我们发现计算机是连不上交换机了

# 生成树协议

如果企业的网络非常重要(比如医院的网络)，为了避免汇聚层和核心层设备故障造成网络故障，可以设计成双核心层和双汇聚层

![1566390797987](E:\git-workspace\note\images\computeNetwork\1566390797987.png?raw=true)

为了避免广播风暴，有了生成树协议

交换机也是有一个MAC地址的，我们可以用这个MAC地址进行远程管理

生成树协议产生的步骤：

1. 选择根交换机（首先比较交换机的优先级，然后比较Mac地址）
2. 选择根端口（交换机上哪个口距离根交换机比较近）
3. 每根网线端选择一个指定端口（哪个到交换机比较近）
4. 剩下的就是非指定端口

![1566391534684](E:\git-workspace\note\images\computeNetwork\1566391534684.png?raw=true)

![1566391897959](E:\git-workspace\note\images\computeNetwork\1566391897959.png?raw=true)



```shell
enab
#查看生成树的状态
show spanning-tree
```

![1566391984193](E:\git-workspace\note\images\computeNetwork\1566391984193.png?raw=true)

指定交换机为根交换机，只需要改变交换机的优先级

```shell
ena
config t
#更改优先级
spanning-tree vlan 1 priority 4096
```

![1566392456525](E:\git-workspace\note\images\computeNetwork\1566392456525.png?raw=true)

当网络中的交换机数量增加或链路有变化时，所有交换机上重新进行生成树操作来确定阻断端口和转发端口。在完成重新计算之前，交换机不能转发任何数据，完成计算之后，才能转发数据，这个过程需要的时间就是**生成树的收敛时间**，在交换机端口上生成树拓扑从阻塞到转发的典型收敛时间为50秒，也就是说网络拓扑有变化，网络会中断50秒，通过将汇聚层或者核心层交换机设置为根网桥，可以使生成树收敛的又快又好

```shell
#关闭生成树协议
config t
no spanning-tree vlan 1
```



# 交换机的配置模式和常用的配置指令

## 配置模式

```shell
#一般用户配置模式，不能对交换机进行任何的配置
Switch> 

#特权配置模式，是一种查看模式，可以对交换机的各种配置情况进行查看,从一般模式使用enable进入#，
Switch>enable
Switch#


#从特权模式进入全局配置模式,此模式下，可以对交换机进行全局性的配置
Switch#config terminal
Switch(config)#
#or 简写
Switch#config t


#在全局配置模式下的 接口配置子模式
Switch(config)#interface fastEthernet 0/1
Switch(config-if)#
Switch(config-if)#exit
Switch(config)#


#在全局配置模式下的 vlan配置子模式
Switch(config)#vlan 10
Switch(config-vlan)#

```



## 配置技巧

1. tab键自动补全指令

2. 使用问号查看提示帮助

   ```shell
   Switch(config)#h?
   hostname
   ```

3. 在全局配置模式，以及全局配置模式下的子模式，使用ctrl+z可以直接退到特权配置模式

4. 支持命令的无歧义简写

   ```shell
   en-->enable
   config t --> config terminal
   ```

5. `no`指令，用于否定配置的指令





## 交换机上的常用指令

### 设置时钟

```shell
#查看交换机的时钟
Switch#show clock
```

![image-20190825133346649](https://github.com/chenyansong1/note/blob/master/images/computeNetwork/image-20190825133346649.png?raw=true)

```shell
Switch#clock set ?
```

![image-20190825132708799](https://github.com/chenyansong1/note/blob/master/images/computeNetwork/image-20190825132708799.png?raw=true)

```shell
Switch#clock set 18:18:18 ?
#需要指定日
```

![image-20190825132840717](https://github.com/chenyansong1/note/blob/master/images/computeNetwork/image-20190825132840717.png?raw=true)

```shell
#需要指定月
Switch#clock set 18:18:18 1 ?
```

![image-20190825132943208](https://github.com/chenyansong1/note/blob/master/images/computeNetwork/image-20190825132943208.png?raw=true)

```shell
#需要指定year
Switch#clock set 18:18:18 1 oct ?

Switch#clock set 18:18:18 1 oct 2012
```

![image-20190825133057153](https://github.com/chenyansong1/note/blob/master/images/computeNetwork/image-20190825133057153.png?raw=true)



### 设置hostname

```shell
Switch(config)#hostname cisco
cisco(config)#
```

![image-20190825133601505](https://github.com/chenyansong1/note/blob/master/images/computeNetwork/image-20190825133601505.png?raw=true)

```shell
#取消
cisco(config)#no hostname cisco
Switch(config)#
```

![image-20190825133715280](https://github.com/chenyansong1/note/blob/master/images/computeNetwork/image-20190825133715280.png?raw=true)



### 配置password

设置从一般用户配置模式，进入特权配置模式时需要输入的密码

```shell
Switch(config)#enable password ?
#指定一个未加密的密码
Switch(config)#enable password 12345

#我们退到一般用户模式,进入特权模式的时候，会提示输入密码
Switch>enable
Password:
```

![image-20190825134122623](https://github.com/chenyansong1/note/blob/master/images/computeNetwork/image-20190825134122623.png?raw=true)

![image-20190825134336896](https://github.com/chenyansong1/note/blob/master/images/computeNetwork/image-20190825134336896.png?raw=true)

```shell
Switch>config 
#设置一个加密的密码
Switch(config)#enable secret 54321
#同样我们退到一般用户模式,进入特权模式的时候，会提示输入密码
Switch>enable
Password:
```



### shutdown

关闭交换机的端口

```shell
Switch>config 
Switch(config)#
#指定子配置模式，配置interface
Switch(config)#interface fastEthernet 0/1
Switch(config-if)#
Switch(config-if)#shutdown  #将这个interface直接shutdown掉
```

![image-20190825135034293](https://github.com/chenyansong1/note/blob/master/images/computeNetwork/image-20190825135034293.png?raw=true)

![image-20190825135123000](https://github.com/chenyansong1/note/blob/master/images/computeNetwork/image-20190825135123000.png?raw=true)

```shell
Switch(config-if)#no shutdown
```

![image-20190825135303616](https://github.com/chenyansong1/note/blob/master/images/computeNetwork/image-20190825135303616.png?raw=true)



### 重启交换机reload

在特权模式下reload，重启交换机



### 保存配置文件

启动配置文件

当前运行配置文件

保存当前运行的配置文件为 启动配置文件，以保证所做的配置在交换机重启或掉电以后不会丢失

```shell
#查看当前运行配置
show running-config

#查看启动配置
show startup-config

#保存指令
write
#or
copy running-config startup-config

#当前运行配置文件
running-config

#启动配置文件
startup-config

#删除启动配置文件
erase statup-config
```



### 查看交换机中的Mac地址表

```shell
#自主学习计算机的Mac地址，构建了Mac地址表，并根据Mac地址表进行帧数据的转发
#交换机所连接的计算机的网卡地址与交换机的端口的对应关系
Switch#show mac-address-table
```

![image-20190826200908303](https://github.com/chenyansong1/note/blob/master/images/computeNetwork/image-20190826200908303.png?raw=true)



### 查看存储

交换机的存储介质：

1. sdram (内存，当前运行的配置文件)
2. flash（磁盘，存放交换机的操作系统）
3. nvram(启动配置文件，掉电不会丢失)

```shell
#显示交换机的flash存储内容
show flash
```

![image-20190826201702228](https://github.com/chenyansong1/note/blob/master/images/computeNetwork/image-20190826201702228.png?raw=true)



### 查看交换机的端口

```shell
#查看交换机的每一个端口
show interface

#查看某一个端口
show interface fastEthernet 0/1
```

![image-20190826201917183](https://github.com/chenyansong1/note/blob/master/images/computeNetwork/image-20190826201917183.png?raw=true)



### show version

显示交换机的硬件和软件版本



### 配置IP地址

交换机本身可以配置一个用于管理用的IP地址

```shell
#交换机在出厂的时候，默认情况下，所有的端口都属于VLAN1
Switch(config)#interface vlan 1
#or
Switch(config)#int vlan 1
#给VLAN1配置IP地址，就是给交换机配置了管理IP
```

![1566865705893](https://github.com/chenyansong1/note/blob/master/images/computeNetwork/1566865705893.png?raw=true)

```shell
config t
interface vlan 1
no shutdown
ip address 192.168.1.254 255.255.255.0
#ping 192.168.1.1
#!表示ping通
# . 表示没有ping通
```





### 查看ARP缓存

```shell
Swithch#show arp
```

![image-20190826202918977](https://github.com/chenyansong1/note/blob/master/images/computeNetwork/image-20190826202918977.png?raw=true)