[TOC]

![image-20190903194711858](https://github.com/chenyansong1/note/blob/master/images/computeNetwork/image-20190903194711858.png?raw=true)

# 配置交换机的IP地址

如果需要远程管理交换机，那么就需要交换机有IP地址

```shell
#给交换机配置一个Mac地址
#配置VLAN1
Switch#config t
Switch(config)#interface vlan 1
Switch(config-if)#ip address 192.168.1.1 255.255.255.0
Switch(config-if)#no shutdown
```



# 在交换机上实现管理安全配置

## console管理

在线路配置子模式下进行，可以使用login和login local两种方式进行，当然也是可以结合认证服务器(redis)进行登录认证

```shell
##方式一配置:只检查密码
Switch>en
Switch#
Switch#config t
Switch(config)#
#配置console0口
Switch(config)#line console 0
Switch(config-line)#password 12345
#验证方式使用login,表示只使用密码
Switch(config-line)#login
Switch(config-line)#exec-timeout 10
exit
exit
write
reload


##方式二配置：检查用户名和密码
Switch>en
Switch#configure t
Enter configuration commands, one per line.  End with CNTL/Z.
#配置通过console登录的用户名，密码
Switch(config)#username root password 111
#进入配置console的线路
Switch(config)#line console 0
#设置登录方式为：local，即console口登录
Switch(config-line)#login local 
#设置操作的超时时间为10min
Switch(config-line)#exec-timeout 10
Switch(config-line)#exit
Switch(config)#exit
Switch#
%SYS-5-CONFIG_I: Configured from console by console
#写入启动配置文件中
Switch#write
Building configuration...
[OK]
#重启交换机
Switch#reload
Proceed with reload? [confirm]yC2960 Boot Loader (C2960-HBOOT-M) Version 12.2(25r)FX, RELEASE SOFTWARE (fc4)
Cisco WS-C2960-24TT (RC32300) processor (revision C0) with 21039K bytes of memory.
2960-24TT starting...
#登录测试
User Access Verification

Username: root
Password: ****

Switch>
```



## telnet管理

![image-20190903195959520](https://github.com/chenyansong1/note/blob/master/images/computeNetwork/image-20190903195959520.png?raw=true)

如果需要远程管理交换机，那么就需要交换机有IP地址

配置要求：用户Telnet登录进入到交换机一般用户配置模式时，要求检查用户名和密码

```shell
#给交换机配置一个管理IP地址
#配置VLAN1，交换机出厂的时候，所有的端口默认是属于VLAN1
Switch#config t
Switch(config)#interface vlan 1
Switch(config-if)#ip address 192.168.1.1 255.255.255.0
Switch(config-if)#no shutdown
Switch(config-if)#exit
#设置默认网关
Switch(config)#ip default-gateway 192.168.1.254


#
#设置line vty 0-4,即同时允许最多5个Telnet客户端登录到交换机
Switch(config)#line vty 0 4
#设置密码
Switch(config-line)#password 123456
#验证方式用login
Switch(config-line)#login



##方式2：用户用户名登录验证
Switch(config)#username root password 12345 
Switch(config)#line vty 0 4
#验证方式用login
Switch(config-line)#login local
```

使用客户机远程登录交换机

![image-20190826205546673](https://github.com/chenyansong1/note/blob/master/images/computeNetwork/image-20190826205546673.png?raw=true?raw=true)

![image-20190826205805194](https://github.com/chenyansong1/note/blob/master/images/computeNetwork/image-20190826205805194.png?raw=true?raw=true)

## 设置enable密码

```shell
#使用明文密码
Switch(config)#enable password 12345

#使用加密的密码
Switch(config)#enalbe secret 54321

#使用show running-config查看

```

![image-20190826210058522](https://github.com/chenyansong1/note/blob/master/images/computeNetwork/image-20190826210058522.png?raw=true?raw=true)





## ssh连接管理

使用Telnet进行连接的时候，用户名和密码都是明文的方式在网络中进行传输的，如果存在监听的话，密码会可能会泄漏，而ssh是加密传输的

![image-20190826210851338](https://github.com/chenyansong1/note/blob/master/images/computeNetwork/image-20190826210851338.png?raw=true?raw=true)

```shell
Switch(config)#line vty 0 4
#配置进行交换机的方式：选择使用的协议
Switch(config-line)#transport input ?
```

![image-20190826210440138](https://github.com/chenyansong1/note/blob/master/images/computeNetwork/image-20190826210440138.png?raw=true?raw=true)

```shell
#进入交换机只能使用ssh
Switch(config-line)#transport input ssh
Switch(config-line)#exit

#配置一个domain
Switch(config)#ip domain-name gzeic.com
#根据交换机的名称gzeic.com产生SSH所需的额秘钥
Switch(config)#crypto key generate rsa
```

![image-20190903201958883](https://github.com/chenyansong1/note/blob/master/images/computeNetwork/image-20190903201958883.png?raw=true)



![image-20190826211327951](https://github.com/chenyansong1/note/blob/master/images/computeNetwork/image-20190826211327951.png?raw=true?raw=true)